presentation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>11/27/18 Design Presentation</title>
<meta name="author" content="(Samuel Breese and Jordan Alligood)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">11/27/18 Design Presentation</h1><h2 class="author">Samuel Breese and Jordan Alligood</h2>
</section>

<section>
<section id="slide-sec-">
<h2 id="org4ed54e2">Introduction</h2>
<ul>
<li>Implementation in Haskell</li>
<li>Using advanced type-level features to abstract over ciphers and hashes</li>

</ul>
</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org82bf172">Why Haskell?</h2>
<ul>
<li>Safety guarantees
<ul>
<li>Avoid buffer overflow</li>

</ul></li>
<li>Trivial parallelism for brute-force
<ul>
<li>Parallelism is a compiler option</li>

</ul></li>
<li>Good libraries, big integers in standard library</li>
<li>Abstraction</li>

</ul>
</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org61127a9">Status of implementation</h2>
<ul>
<li>RSA and SHA-1 implemented fully</li>
<li>DH key exchange</li>
<li>SDES ported to common interface for brute-force attack</li>
<li>Currently debugging SHA-256 implementation</li>

</ul>
</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org854b546">Future implementation plans</h2>
<ul>
<li>ElGamal and ECC (fun, fairly easy)</li>
<li>A good block cipher (harder)
<ul>
<li>Probably Triple-DES :(</li>

</ul></li>
<li>Some PRNGs/stream ciphers
<ul>
<li>Using <code>/dev/random</code> for RSA prime generation, Miller-Rabin, etc.</li>

</ul></li>
<li>Deriving instances of cipher interface automatically for PRNGs</li>
<li>Generic HMAC on our hash interface</li>

</ul>
</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="orgc133495">Eventual result</h2>
<ul>
<li>Hopefully a client compatible with SSL 3.0/maybe TLS 1.0 if we're ambitious</li>
<li>Overlap:
<ul>
<li>RSA or DH for key exchange</li>
<li>3DES for cipher</li>
<li>SHA1 for data integrity</li>

</ul></li>
<li>Architecture is general enough to support whatever we want, so just having fun at this point.</li>
<li>Unsure of how much is expected for the assignment</li>

</ul>
</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org4f0de78">Security considerations</h2>
<ul>
<li>Unlikely that we'll implement algorithms for "modern" TLS by the deadline</li>
<li>Trying to avoid things that are <i>really</i> easily broken
<ul>
<li>MD5</li>
<li>RC4</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org9904597">Brute-force attack for any implemented cipher</h2>
<ul>
<li>Given a cipher instance and a plaintext-ciphertext pair, finds the key</li>
<li>(Eventually)</li>
<li>Probably for hashes too, if we need it</li>

</ul>
</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org5fad9d0">Examples</h2>
<ul>
<li>Using an interesting technique to abstract over input/output types of ciphers/hashes.</li>
<li>Effectively, emulating dependent records with typeclasses and type families.</li>
<li>Advantage over just using a typeclasse: allows us to explicitly pass around and store typeclass instances.</li>

</ul>
</section>
<section id="slide-sec-">
<h3 id="org6f47b1d">Hashes</h3>
<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #a1db00;">data</span> <span style="color: #00d7af;">Implementation</span> (a <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span>) (p <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span>) (h <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span>) <span style="color: #ff8700;">=</span> <span style="color: #00d7af;">Implementation</span>
  { hash <span style="color: #ff8700;">::</span> p <span style="color: #ff8700;">-&gt;</span> h
  , parsePlaintext <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">ByteString</span> <span style="color: #ff8700;">-&gt;</span> p
  , renderHashtext <span style="color: #ff8700;">::</span> h <span style="color: #ff8700;">-&gt;</span> <span style="color: #00d7af;">ByteString</span>
  }

<span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Hash</span> (a <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span>) <span style="color: #a1db00;">where</span>
  <span style="color: #a1db00;">type</span> <span style="color: #a1db00;">family</span> <span style="color: #00d7af;">Plaintext</span> a <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span>
  <span style="color: #a1db00;">type</span> <span style="color: #a1db00;">family</span> <span style="color: #00d7af;">Hashtext</span> a <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span>
  name <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Text</span>
  impl <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Implementation</span> a (<span style="color: #00d7af;">Plaintext</span> a) (<span style="color: #00d7af;">Hashtext</span> a)

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">Impl</span> a <span style="color: #ff8700;">=</span> <span style="color: #00d7af;">Implementation</span> a (<span style="color: #00d7af;">Plaintext</span> a) (<span style="color: #00d7af;">Hashtext</span> a)
</pre>
</div>
</section>
<section id="slide-sec-">
<h3 id="org29233ae">Lookup tables</h3>
<ul>
<li>Represented as heterogeneous association lists</li>

</ul>
<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #a1db00;">data</span> <span style="color: #00d7af;">Lookup</span> (k <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span>) <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span> <span style="color: #a1db00;">where</span>
  <span style="color: #00d7af;">None</span> <span style="color: #ff8700;">::</span> <span style="color: #a1db00;">forall</span> (k <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span>)<span style="color: #ff8700;">.</span> <span style="color: #00d7af;">Eq</span> k <span style="color: #ff8700;">=&gt;</span> <span style="color: #00d7af;">Lookup</span> k
  <span style="color: #00d7af;">Some</span> <span style="color: #ff8700;">::</span> <span style="color: #a1db00;">forall</span> (k <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span>) (a <span style="color: #ff8700;">::</span> <span style="color: #00d7af;">Type</span>)<span style="color: #ff8700;">.</span>
    (<span style="color: #00d7af;">Hash</span> a, <span style="color: #00d7af;">Eq</span> k) <span style="color: #ff8700;">=&gt;</span> k <span style="color: #ff8700;">-&gt;</span> <span style="color: #00d7af;">Impl</span> a <span style="color: #ff8700;">-&gt;</span> <span style="color: #00d7af;">Lookup</span> k <span style="color: #ff8700;">-&gt;</span> <span style="color: #00d7af;">Lookup</span> k
</pre>
</div>
</section>
<section id="slide-sec-">
<h3 id="org3793e2f">Similar construction for ciphers</h3>
<ul>
<li>More elaborate, more types involved
<ul>
<li>plaintext, ciphertext, encryption key, decryption key</li>

</ul></li>
<li>Symmetric and public-key ciphers have an identical interface</li>

</ul>
<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #a1db00;">instance</span> <span style="color: #00d7af;">Cipher</span> <span style="color: #00d7af;">RSA</span> <span style="color: #a1db00;">where</span>
  <span style="color: #a1db00;">type</span> <span style="color: #00d7af;">EncryptionKey</span> <span style="color: #00d7af;">RSA</span> <span style="color: #ff8700;">=</span> (<span style="color: #00d7af;">Integer</span>, <span style="color: #00d7af;">Integer</span>) <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">(e, N)</span>
  <span style="color: #a1db00;">type</span> <span style="color: #00d7af;">DecryptionKey</span> <span style="color: #00d7af;">RSA</span> <span style="color: #ff8700;">=</span> (<span style="color: #00d7af;">Integer</span>, <span style="color: #00d7af;">Integer</span>, <span style="color: #00d7af;">Integer</span>) <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">(d, p, q)</span>
  <span style="color: #a1db00;">type</span> <span style="color: #00d7af;">Plaintext</span> <span style="color: #00d7af;">RSA</span> <span style="color: #ff8700;">=</span> <span style="color: #00d7af;">Integer</span>
  <span style="color: #a1db00;">type</span> <span style="color: #00d7af;">Ciphertext</span> <span style="color: #00d7af;">RSA</span> <span style="color: #ff8700;">=</span> <span style="color: #00d7af;">Integer</span>
  name <span style="color: #ff8700;">=</span> <span style="color: #ff4ea3;">"RSA"</span>
  impl <span style="color: #ff8700;">=</span> <span style="color: #00d7af;">Implementation</span> {<span style="color: #ff8700;">...</span>}

<span style="color: #a1db00;">instance</span> <span style="color: #00d7af;">Cipher</span> <span style="color: #00d7af;">SDES</span> <span style="color: #a1db00;">where</span>
  <span style="color: #a1db00;">type</span> <span style="color: #00d7af;">EncryptionKey</span> <span style="color: #00d7af;">SDES</span> <span style="color: #ff8700;">=</span> <span style="color: #00d7af;">Bits</span> <span style="color: #00d7af;">Ten</span>
  <span style="color: #a1db00;">type</span> <span style="color: #00d7af;">DecryptionKey</span> <span style="color: #00d7af;">SDES</span> <span style="color: #ff8700;">=</span> <span style="color: #00d7af;">Bits</span> <span style="color: #00d7af;">Ten</span>
  <span style="color: #a1db00;">type</span> <span style="color: #00d7af;">Plaintext</span> <span style="color: #00d7af;">SDES</span> <span style="color: #ff8700;">=</span> [<span style="color: #00d7af;">Bits</span> <span style="color: #00d7af;">Eight</span>]
  <span style="color: #a1db00;">type</span> <span style="color: #00d7af;">Ciphertext</span> <span style="color: #00d7af;">SDES</span> <span style="color: #ff8700;">=</span> [<span style="color: #00d7af;">Bits</span> <span style="color: #00d7af;">Eight</span>]
  name <span style="color: #ff8700;">=</span> <span style="color: #ff4ea3;">"SDES"</span>
  impl <span style="color: #ff8700;">=</span> <span style="color: #00d7af;">Implementation</span> {<span style="color: #ff8700;">...</span>}
</pre>
</div>
</section>
</section>
<section>
<section id="slide-sec-">
<h2 id="org5e3ca8f">Questions?</h2>
</section>
</section>
</div>
</div>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/head.min.js"></script>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
